长生】

四柱命局得长生，身强体健人聪明。

命中福星来照命，事业前景食禄丰。

年柱长生父母爱，月柱兄弟姊妹恩。

日柱一身多富贵，时柱子女有高升。

【沐浴】

沐浴原名叫桃花，男女淫乱不由他。

如临子午多赊欠，卯酉临之酒食贪。

年柱多主父母事，月柱夫妻各生涯。

日坐沐浴父缘薄，时柱名曰外桃花。

【冠带】

命局冠带人聪慧，风流好赌要提防。

幼龄儿童作诗赋，中年功名运势强。

年柱冠带祖业旺，月柱父兄大吉祥。

日坐冠带事业展，时上子女贵无双。

【临官】【帝旺】

临官帝旺最为强，禄贵同宫大吉昌。

谋事诸般皆遂意，财运事业震四方。

年柱官旺祖业好，月柱临之食禄强。

日柱有它多富贵，时旺子女入朝堂。

【衰】【病】【死】

衰病死运柱中逢，吉凶成败在其中。

只因命逢衰病死，灾祸绵绵疾病凶。

年柱祖业必衰落，月柱事业运不通。

日柱自身运不好，时柱后人不兴隆。

【墓】

命逢墓库时运衰，墓待冲开好运来。

女命最怕坐墓库，口舌频频是非灾。

年柱临之祖业废，月柱父母应破财。

日上墓库运蹩滞，时上遇墓后人衰。

【绝】

命运逢绝必主忧，天灾人祸不自由。

绝处逢生可有望，五行制化可推求。

年柱逢绝祖业败，月柱双亲命有忧。

日绝夫妻有灾难，时绝子女命难留。

【胎】

命逢胎运甚为奇，时来运转不需疑。

胎运职业多更变，只是婚姻易分离。

年柱逢胎祖业旺，月胎父母最相宜。

日上胎神当为贵，时逢头胎女花枝。

【养】

养神吉凶识者稀，半凶半吉两相宜。

多得父母双亲助，只怕桃花运不离。

年柱相逢是样子，月逢养柱运不低。

日坐养地命运好，时养子女孝可知。




###############
【长生】表示万物初生的阶段，生机勃勃，喜悦，创新，生活事业上有新的转折和变化。

【沐浴】表示事物在生长过程的初期，属于一个比较脆弱的阶段，如同婴幼儿沐浴，有阶段性的衰败运势，尤其主人贪恋灯红酒绿，甚有淫乱之危，所以，古人讲沐浴也叫败地，兼有桃花运的含义。

【冠带】如同一个人长成了一个少年，注重衣冠形象（学习成长），穿戴整齐即将步入社会。这个阶段多是平常运势，但大方向是向好的，因为毕竟接下来就是临官了。

【临官】此时多代表一个人正式步入社会，开始崭露头角，积极进取，身心都达到一个非常成熟兴旺的状态，此时往往也是一个人精力最充沛的阶段，一切都刚刚好，一切都在持续向好，所以临官也被称为禄。

【帝旺】依然是兴旺发达，精神焕发，甚至可以说此时发展到了巅峰状态，一种极其满足，饱满的状态，但是比起临官，帝旺已经有盛极将衰的隐忧，可谓过犹不及。所以，帝旺其实就是我们说的羊刃。

【衰】事物发展到顶峰之后开始由盛转衰，这基本上是事物发展的必然规律，尤其在我们中国的传统文化中，对盛极而衰是有文化共识的。运行衰地的时候，多主生灾或疾病缠身，百事不顺。

【病】如同人因为体力衰弱而疾病入侵，精神萎靡，运势上多灾难，运气不佳。

【死】凶，毁灭，这个阶段最容易出现骨肉离散、官司口舌，刑狱车祸等凶灾恶祸并临。

【墓】墓有两种解释，各有自己的应用场景，一说是死亡后葬入墓地，渐渐被人遗忘，沉寂，被埋没，无人问津；另一说是人财物入库存储的象征。整体来说墓还是不吉利的运程，人往往被埋没，很难发迹，即便是代表财库的墓，也需要有其他喜用神的帮助，冲开墓库，才能有财源广进之象。

【绝】表示事物湮灭，从这个世界上彻底消失，尘归尘，土归土，此运势上多有令人唏嘘的厄运，但此时的状态处于下一轮轮回的临界点，先仪的经验和理解，这个阶段有很多玄而又玄的灵异特质，处理的好，往往对之后的命运有意想不到的影响。

【胎】如人在母腹之中，万物刚萌芽，此时虽然弱小，但在母运的保护下，充满生命力与希望，有发展的前途，多平安无事。如果此运对应的柱中有帮扶则会更佳。

【养】指万物在自然中形成之象，即将开始新一轮的发展。



####################

十二长生
简介编辑
十二生旺库是以日干对照年、月、日、时四个地支，而做出其性格，以及运程之论，一般来讲年支命限上属于幼年时期，月支代表青年时期，日支是代表中青年时期，时支代表晚年时期。在这里面最重要是日支，因为日干代表自己，同时一个人的中青年运程，往往可以决定这个人一生的荣辱成败。看年龄阶段可以重点看那个支，一般要综合分析。

十二长生即五行的十二种运势：长生、沐浴、冠带、临官、帝旺、衰、病、死、墓、绝、胎、养。称十二运为十二长生，是以起首之“长生”代表整个十二运。
十二长生描述了“生老病死”的一生，也用来比喻天下万事万物产生、发展、衰败消亡的整个过程。

描述
长生：婴儿刚出世，或新事物刚产生时，具有欣欣向荣的气息。
沐浴：又称“败”。婴儿降生后须洗去污垢；新事物初登台，很不完善。
冠带：从小儿到青年，可以穿衣戴帽，显得仪表堂堂；新事物也进入了华秀的阶段。
临官：又称“进禄”。人长成后，可以出仕做官，或挣钱养家；新事物也已成熟，地位日益巩固。
帝旺：人到壮年，身体和智力都到了鼎盛阶段，最能全面发挥一个人的作用；新事物已至完善，被世所公认。然而旺极必衰，无论是人是事，到了鼎盛阶段，也同时播下了衰败的种子。
衰：这是一个质的变化期，人至此感到气衰神弱，力不从心；新事物至此已成旧事物，该面临其他新事物的挑战了。
病：人逐渐衰老，便要百病丛生；旧事物千疮百孔，积重难返。
死：人衰老之后，继之就是肉体的死亡
墓：旧事物死亡后遗迹被送进博物馆，或被收于仓库，又叫“库”
绝：又被称“受气”、“胞”。人在未受孕前，母腹内空空荡荡；万物未产生前，无形无象。
胎：即受胎，指人受孕时，或万物在地中萌芽时。
养：就是成形，人在母腹中成形，万物在地中成形。
十二长生中，长生、冠带、临官、帝旺代表旺盛的运势，称为“四旺运”，败、死、暮、绝，代表恶劣的运势，称为“四恶运”，衰、病、胎、养代表平淡的运势。

八字上的解读编辑
长生
一般来说，长生运是比较吉祥的。长生也是生长，无中生有，所以八字中命坐长生的人，有创造、开拓、发展的能力。长生的地支都有印星，可以生助自己，所以在长生的大运或者流年思维特别活跃，容易有新的想法和思路。缺点是生处怕冲，冲则根基不稳，严重的则是连根基都没有了，对应心态，则容易有意气消沉的倾向。冲印星的五行是财星和伤官食神，财星是利益，食神是自己的想法和主张，对应现实就是利令智昏，或者自作聪明。长生被冲，则生而不生，反而由于自己的轻举妄动而带来失败和打击。
八字命局或大运在长生的人，找工作最好中在机制健全的大单位，做独当一面的开拓、发展、研究的工作，这样在他工作期间假如出现了某种困难，则会由高级主管或者其他协办单位来解决，不必自己出现双重负担。假如是个人的话，则需要做长期的思考，而不是短期的利益或者虚荣。当然，身边最好有长辈或者专业人士可以咨询，这也就是暗藏的印星的力量。
长生有着性格温顺，尊重他人，举止安祥等等美德，十天干的长生以丙寅、壬申最为吉祥。女命在月、日地支自坐长生者，容貌端正、娇柔，性格内向、温顺。四柱不见刑冲，即使是夫星不居旺位，也可以有和谐的家庭。有一点要注意就是：“时支不可带帝旺”切记切记。下面按天干分坐来具体说明：
甲木长生在亥，假如生于冬季，冬水不生木。所以，此人有些刻苦、耐怨的坚韧性格。
乙木长生在午，坐泄身生财，做事有太过于为他人着想的弱点。
丙火长生在寅，自坐长生，本是自生自旺。做事有乐观、积极的持久性。
丁火长生在酉，男性得女性的合作。相当于天乙贵人，有着聪智、把握环境，能运用和把握时机，然而稍有独裁的心态。
戊土长生于寅，土木相制，自我色彩稀薄。在困难中，逐项克服。尊重环境，少有自己一定要如何如何之武断
己土长生在酉，自坐食神，四柱天干最好见丙火。由于，阴土无丙火，生长乏力，做事进展缓慢，性格易于满足，有默默耕耘的美德。
庚金长生在巳，需要明见壬水为吉。此种情况，多数都是一生在逆境中成长，很少有自成之富业，基本是越见艰辛越有成就。百折不挠性格的典型代表。
辛金长生在子，即是伤官，为人带有一些骄态，然而大家要晓得，阴金的骄，并不会象阳干那样骄气逼人，他只是令人感到有些在客气中疏远你，比较委婉，不是那么直截了当。有一种令人十分明显易知的标准。
壬长生在申，是属于理智性格的人，头脑灵活。
癸长生在卯，相当于天乙贵人，若遇刑冲，有托于人，必有善意的响应。为人聪明，条理分明。[1]

沐浴
沐浴，是一个比喻，并不是真的洗澡，沐浴是五行的天干之气在形成后，开始轻扬而上，上升到什么程度了呢？就是刚与地分开，尚未升起的那种“地面之气”。这种气很容易被地面吸收回去，“嫩气”而已，没有什么抵抗力。结合到人生呢，沐浴这个状态恰是人接受教育之时，初接触人事，容易受蛊惑，处理不好就容易招致人生的失败。
一般来说，八字中带沐浴的人，做事情爱凭直觉，作过了以后，又后悔不该多此一举。与父亲相处不佳，有独立、离家、流浪、变易的特性。性格有多方面的才能，然而不能长久专心于一件事情上发展。男性与异性容易发生纠葛，假如八字中有两个沐浴的人，则多为受异性的压迫。女性两个沐浴的人好貌美，并且做事干练，能很好的控制对象。下面按天干分坐来具体说明：
甲木沐浴在子，生于冬季的人，做事情需要自力更生，坚持不懈才可成功。女人则有感情纠葛之苦。
乙木沐浴在巳，易为财所困，为人比较务实，不喜欢讲空话。其人做事情比较积极，然而健康状况不佳。
丙火沐浴在卯，主有才艺，受母亲影响较深。
丁火沐浴在申，理财有方，无刑冲者，男命得贤淑有助之妻。
戊土沐浴在卯，木土相克，家庭责任压力大，大部分为直系亲属所累。女命四柱无刑，为人温顺顾家，并且得有势的丈夫。
己土沐浴在申，相当于伤官，为人聪明有智慧，而且自负，自命非凡。
庚金沐浴在午，有超越凡人的才艺，有真才实学，基本是苦练而成。
辛金沐浴在亥，冬季金水伤官，不论男女只要地支有寅就是好命。
壬水沐浴在酉，只主有文才、艺术。
癸水沐浴在寅，个性柔和，虽然有伤官之才智，然而水木转柔，容易受环境的引诱缺乏独立的心胸。[2]

冠带
冠就是帽子的意思，带就是古代配饰的意思。冠带也是古代男女年满二十岁所举行的成年礼节式，说明已经成人了。冠带主喜庆，以事情、事业之成就为喜庆，临于命身主吉，亦主小贵，临于限则主小成、进财，取喻于男冠女笈之小成。
一般来说，八字中命坐冠带的命造，自尊心过强，喜欢支配他人，不愿为人所支配，所以，很容易树敌。女人，则是有男性气概。此种女人好指使丈夫，然而，对外家人却要十分的照顾。还有这个说法：冠带兄弟乡，纵有隔山岗，虽然共屋住，烟火两头光。这只是一种倾向，请大家使用时酌情判定，以免发生错误，由于易学毕竟是千变万化的，不可以生搬硬套。下面按天干分坐来具体说明：
甲木冠带在丑，做事情有依靠他人的习惯，很难自己成大事，不喜冲动。
乙木冠带在辰，是安份守成，安守故常之人。
丙火冠带在辰，女命婚姻不佳，男命在辛顶苦中有成。
丁火冠带在未，中年有壮志。
戊土冠带在辰，全力做事，终能达成愿望。如八字命局中有戌冲的人，多被朋友出卖。如有辰辰自刑，一般情况下做事情比较混乱，没有好的计划。
己土冠带在未，柔中有刚，很会见风使舵，能较好的把握时机，顺时而为之人，有成就。

庚金冠带在未，生于冬月，天气过寒，五行之气流通不好，必须四柱别支见丁火，才会有作为的，缺者碌碌无为之人。
辛金冠带在戌，略有土重金埋之意，根据五行喜忌来论，辛金，本是珠玉之金，不喜锻炼，只喜壬水淘洗，这是才能体现辛金的光芒，体现人生的价值，但需八字见壬水才能有所作为。
壬水冠带在戌，此时最忌四柱五行不全，气韵无法流通，这时八字的喜忌也最难掌控，要随着气的长短进退来综合决断。
癸水冠带在丑，此时金寒水冷，万物伏藏，生气全无，所以此时最需要太阳之火普照，方显大自然的无穷魅力。八字命局癸水日主冠带在丑时，切记不可以旺衰来论，此时最需要的是丙火普照，丙为太阳之火。[3]

临冠
临冠也有说成临官的，冠就是帽子，也是一个人通过胎、养、长生、沐浴、冠带之后，开始要考取功名的时候。古代人的学而优则仕，开始出来当官，或是付出的心血能够得到回馈。在一些预测学中，临冠含有公众的、官府、有病、灾祸、有男人在身边、离死不远、巴结当官的、阿谀奉迎、出仕、当官、拍马屁、有官运、有地位、公务员、自力更生、自我努力、成长、快要成功、国营、危险等意思，看来是和官运有关。
一般来说，八字中有临冠的人，独立性比较强，有比肩的特性。命带临冠的人，一生波折会照凡人多一些。由于有一种倔强不服输的精神，八字带临冠的人虽说波折较凡人多，却可以在波折衷不断的努力，开创一片天地，有所成就。这种人对待波折并不太在意，会认为这是人生的必然现象。下面按天干分坐来具体说明：
甲木临冠在寅，若是在坐支的，按淫欲杀论，主夫妻不合，假如在提纲上，按建禄论。
乙木临冠在卯，八字中透财官的，不论别支怎样，此造一定会有富裕的岁月，时间长短别论。
丙火临冠在巳，生在夏月，八字中天干需见壬水，然而也主身体衰弱。
丁火临冠在午，生与春季，四柱要见金，生与冬季需要有木（甲木）。
戊土临冠在巳，此时喜印，由于旺土喜燥而不喜污湿．所以代印为吉。
己土临冠在午，旺土属阴，柔和随世中有成。
庚金临冠在申，阳金性刚，与异性不易相处，此时最喜四柱天干见财官，大气可成。有官无财，贵气难延，终有亏损。
辛金临冠在酉，等同于阴错、红艳，主损坏夫妻感情．`
壬水临冠在亥，冬生，最喜八字中丙火高透。
癸水临冠在子，冬生者，多半有离家四方漂流的艰辛，从事多种职业，有背井离乡异地发展之象。[4]

帝旺
十二长生中，临冠过后便是帝旺了，在临冠中我们讲了一个人开始做官，应该算是走上正路，到了帝旺就是要达到顶峰。这个阶段也是人生命力最旺盛的时期，如日中天，是生命力的顶峰，而一过顶峰，便渐走下坡。
帝旺主旺壮，亦主贵吉，主做事称心遂意，主利禄进财、产育子女等喜庆。取喻盛年心身成熟之极致，如帝王权位之旺，已达颠峰，寓衰退之危机。有的预测书上写的帝旺，说他是含有荣发、发达、自得、精神、兴奋、神气、有力、雄壮、高大、擅长、强大、辉煌、欣欣向荣、腾达、有权、极限、高潮、顶点等意思。
一般来说，八字中有帝旺的命造，在十二支位中，是最为旺盛的。阳日主的帝旺实际就是阳刃，有着一些盛极欲衰的倾向，强到有力不从心之感。这种命造有强烈的自尊心，有点物极必反之理。一般男命与父母缘薄，与岳母家人却很投缘；女人则会凌驾丈夫之上，难以和谐。下面按天干分坐来具体说明：
甲木帝旺在卯，个性刚强，然而却是很有仁慈之心。
乙木帝旺在寅，为人心胸宽宏，有修养，然而有点做事比较守成，缺乏冲劲，倒是不会出现太大的过错。
丙火帝旺在午，做事胆大妄为，不惧艰辛。女性的对象最好是八字中带魁罡。
丁火帝旺在巳，在与异性交往中多有纠葛，女命最忌。
戊土帝旺在午，喜八字中见丑土，丑土卑湿可以润局，女喜高大英俊的男子。
己土帝旺在巳，女命己巳日为金神，婚姻不顺。
庚金帝旺在酉，八字中无火的命造不吉，恐有天灾之祸。
辛金帝旺在申，荏弱之金，珠玉之金是也，最喜壬水淘洗，可发其光辉。注意：这里不能用金旺喜水泄来理解，此时辛金忌癸水，也就是食神之水。
壬水帝旺在子，最忌生在卯月，乃是背禄逐马，不论男女，婚姻不佳。
癸水帝旺在亥，天干透出壬水，乃不受约束之人，女命则有丧夫之虑。
世界万事万物的变化，生旺不一定就是吉祥，碰到休囚死绝也不一定论凶。假如旺过了头，应该用别物而予以压抑制伏；假如是死绝或是气势不够旺，亦该有别物而来扶持或补救。总而言之，八字五行强调的是相生相克之间的中和，太过或不及皆非吉论。[5]

衰
衰，经过了前面的长生、冠带、临冠、帝旺以后，到了命理中衰这个阶段了，便渐走下坡了，也就是开始由大到小依照一定的标准递减。衰依据字面的意思分析，就是旺极而衰的意思，命理中的衰主颓丧，守于身命，说明缺乏进取心，容易遇事颓废，遇挫沮丧，入限则主多招是非、疾病、破财、衰退。取喻生命精力之衰退，缺乏克服困难的精神和耐性。有的预测书上衰是含有无力、软弱、衰弱、弱小、不景气、弱智、败落、力小、倒霉、退缩、没靠山、弱点、胆小、虚弱、矮小、无能、没本事、不学无术、高不成低不就、不敢反抗等意思。
一般来说：八字中有衰的命造，体现的表象是：保守、成熟、不会委曲。人世间的大部分经历都已经尝试过，也都有一定的经验，所以这种人办事比较稳妥，不张扬，有韧劲，容易满足。这里要注意一下，这里的衰和八字旺衰是有区别，不是一个概念的。
下面按天干分坐来具体说明：
甲木衰在辰，此时的甲木，已经生长到了一定的极限，俨然是一个巨大的木材，这时最需要的是物有所值了，怎么才能物有所值呢。最喜八字见金，才会成为可造之材，由于五行讲的是气，并不是实质的东西。
乙木衰在丑，此时天寒地冻，最需要丙火暖局，假如此时八字中没有丙火，就会一生怕事，做事情畏首畏尾。
丙火衰在未，此处最为关键，未有余温，干燥，带有一种双重性。此时，假如八字中再见未土，此人就具有伤官心性了，假如没有，此人一定是为人性情温顺很随和的，然而缺乏创造力。
丁火衰在辰，相当于"伤官合杀库"，略带骄与萧杀之气，性格多变，易反复。
戊土衰在未，此处以劫财论，用衰金衰木搭配最好。要的是耗泄，金木太旺反而会破局。
己土衰在辰，春土最需要的是丙火，此时土质虚弱，木的余气尚存，有丙火照耀，方成大气，无丙则不成矣。
庚金衰在戌，在日支以魁罡论，性情刚强，有丁火出现方可言吉。女性魁罡，长相漂亮，然而个性练达、刚强。
辛金衰在未，此处最为明，余夏之火最喜壬水伤官。
壬水衰在丑，此时万物可缺，惟独不可缺少丙火，此时天寒地冻，万物不生，水结成冰。水虽然代表智慧，然而此时的智慧停滞不前，毫无用武之地，无用之人。有丙火普照，发起生机，方显自身价值。
癸水衰在戌，财库透官，最喜有冲。[6]

病
病从字面的意思上讲是生物体发生不健康的现象，有缺点、错误、损害、祸害、不满、责备等等。有的预测书说病是含有疾病、病灶、瘟神、讨厌、憎恨、仇人、仇视、不足之处、缺点、欠缺、毛病、弱点、漏洞、痛处、要害、心病、腐败、问题等意思。
一般来说：八字中有“病”的命造，举止缓慢，考虑太多。乃至于自坐病地的人特别敏感，由于考虑的太多，而错失机会。其人喜欢公益事业，多喜尽一己之力，爱与恨都很极端，有洁癖，性格坚毅，然而有良好的风度。虽然有些敏感，却不会后悔。阴日主的人，性格不稳有些萎缩，兄弟之间不能和穆相处。下面按天干分坐来具体说明：
甲木病在巳，男得妻之助力，女则有贸易的天资。
乙木病在子，贵人正印，秀雅有艺术感，八字中若有刑冲，则为微贱文人。
丙火病在申，为人有正义感，夜间生人有宗教思想。
丁火病在卯，有不合群的性质，然而依然风度翩翩。
戊土病在申，即是食神，女有自立的财务能力。
己土病在卯，若是八字日主自坐，为妨害杀对婚姻不利。
庚金病在亥，带丙火的是领导一方社会的贤达人士。
壬水病在寅，三壬寅者大富。
癸水病在酉，文昌之命，以及宗教，艺术皆可适应。[7]

死
死是比较好理解的，一般是含有死亡、钻牛角尖、不灵活、不能变通、滞留、终结、完蛋、认死理、一条道走道黑、没有余地、不景气、无生气、无活力、呆板、笨拙、想不开、心胸狭窄、无退路、寂静、安静、可怕等意思。
死在十二生旺库的星位上而言，指的是性格与事业上的过程，不管这个过程是成是败。（在这里和大家说的死亡还是有区别的。）一般来说：八字中有死的命造，外柔内刚，命带此星，如不被刑冲的人，做事稳妥；属于办事情比较有恒心的一种；在外面与人相处融洽；女命带有两个以上病支的命造，婚姻多不好；乙亥、庚子日的女命家庭婚姻尤其不好；命坐死地的，大部分是有专长或者懂得技艺的人。下面按天干分坐来具体说明：
甲木死在午，相当于食伤生财，男命比较好，女命则是一财得所，红颜失配，婚姻不好。
乙木死在亥，女命最忌，如生于亥月，八字中不可缺火，否则容易一事无成。
丙火死在酉，八字中最忌酉中的辛金透出天干。
丁火死在寅，心胸宽广。
戊土死在酉，新陈代谢的关系，也为伤官，有承前启后二度事业的创造机会。
己土死在寅，性格温顺，但怕见乙木重见。
庚金死在子，八字日主自坐的不利女命，假如生于子月，八字中必须有火才妙。
辛金死在巳，最喜四柱天干见壬水。
壬水死在卯，女最忌，男也有感情上的纠葛。
癸水死在申，不宜冬生，假如再是夜生的话，主漂泊。[8]

墓
我们常说墓是泉台、墓地、墓园、墓道、墓碑、宅兆，似乎和死有很大的关系，实际是在八字命理学上不是这样理解的，这里说的墓也称为库，仓库的库，这样大家就好理解了。八字中带墓的人，最适合于实业界，企业人士，具备守成的美德，同时这样的人有很旺盛的探讨发展的内心状态。还有一点就是生于墓日的人一般多出自清贫之家，先天六亲缘份浅薄；少小离家而劳苦，壮年之前走好运。必须负担起照顾家人的责任，有相当的生财能力，一般都在中年期间得到发展；但在未开运之前的盛衰、起伏很大。婚姻障碍比较多，婚缘看似良佳，实则多见争端。下面按天干分坐来具体说明：
甲墓在未，此时正值盛夏季节，因此八字中必须见明水。
乙墓在戌，这样的人对金钱看得很重。
丙墓在戌，最忌八字中土太重，火土枯燥，此人一生当中会遭遇一场大病。
丁墓在丑，可以当财库论。一生之中，碰到挫折时，反而会成功。
戊墓在戌，自坐者，当魁罡论，男命刚毅果断，女命长相漂亮。
己墓在丑，生于冬月，必须要有丙火方可论吉。
庚墓在丑，丑字忌是月令，否则必须见火。
辛墓在辰，头脑清楚，反应快机智，最喜壬水伤官。
壬水墓在辰，自坐者，用魁罡论。
癸水墓在未，假如八字中无根，一生不宜发达。

绝
绝要当静字解释，是一种绝然安静的自然转变，变得无声无息之中，再显露生机。命坐此绝支的人，基本上是属于十分谨慎的人，流露出很小心的样子，因此这种人不易受人信服，喜欢群体生活，如此，这种命造一般不会感到自己孤独，是属于小心谨慎之中却喜欢热闹生活的一种人。命带此星的人做事不宜从事艰苦持久的事业，只宜做艺术流行性的行业等一些相对轻松的行业。这种性格也不适合做领袖，被人领导更为合理，人缘不佳，由于过于小心，他人不久就会远离。女坐此星，有顺从，娇媚等女性的美德，但举止小心，反喜欢照顾比自己小一些的男子，因此早婚不利。下面按天干分坐来详细说明：
甲木绝在申，地支若三合水局，看作是漂流的良材，平常要经常更换所属之主管。为人聪明伶俐，性急多疑。女命要是自坐的话，气量狭小，好嫉妒。
乙木绝在酉，是天元坐杀，从杀者为贵命。
丙火绝在亥，性格善良，个性急燥，行事缺乏持续与执着力。
丁火绝在子，此为七杀，女命夫旺，忌见三合水局
戊绝在亥，有财，忌日主在四支皆无根，反主体弱不吉。女命不喜亥月，生在亥月，即使命局中有木、火，也代表为家庭辛劳。
己绝在子，四柱需见木火，冬生夜生的，一生婚姻不能安定，女命属于职业妇女，并且孝女之命，常常照顾娘家。
庚绝在寅，是财旺之地，但过程仍然是从机会而得，易患得患失。
辛绝在卯，如果日主是辛卯，和父亲很难和睦相处，同时也为淫欲煞，女命不利婚姻
壬绝在巳，不喜天干见丁字，合壬则不吉．
癸绝在午，生于午月，蒸发过甚，多为他人劳碌，自身所得有限。

胎
胎就像是种子开始发芽，好比小孩在母亲肚子里受气成形。一般来说胎在年柱，表明身体状况较差，有相当保养的必要；胎在月柱，表明中年期间，事业将会有很大的转变；有人改行，有人创业，也有人失业；胎在日柱，表明年轻时候职业多变，中年后吉顺安泰很有发展。注意！一生必有大病一场，徘徊于生死之间；胎在时柱，表明子女个性比较内向，要加强教育。
一般来说：命有胎的命造，基本上是属于理想型的人，是属于设计性自由职业为主的命，一般是先天都是体质弱一些，不喜欢继承父亲的行业，不立大志向，安于目前的生活。同时也有两度婚姻之兆，男命最好晚婚，藏身跺影法，女命要防初婚不顺。下面按天干分坐来详细说明：
甲木胎在酉，秋生需四柱见火。
乙木胎在申，贵人，代表有先天的福业，为人文雅俊秀好。
丙火胎在子，月柱见者，不论男女都是仪容俊雅，但是为人不安分。
丁火胎在亥，冬天生的人，四柱需见甲木出天干。
戊胎在子，日柱自坐得佳妻，如果生于冬天，则四柱需见甲木和丙火。
己胎在亥，视同正财，没有冲刑的，代表此人一生安稳。
庚胎在卯，得佳妻及得妻助，忌干透比劫，代表减福。
辛胎在寅，为人伶俐，有人缘，并有意外之财，但是做事少决断力。
壬水胎在午，视同财官双美，慎于异性的交往，以免招来无妄之灾。
癸水胎在巳，与父亲相处不和谐，也代表容易为娱乐而拖累。
注意：甲乙丙丁胎位在官杀，戊己庚辛壬癸胎位在财位。

养
养如同母亲将小孩生出，此时天地与人开始交感相会。一般而言，养在年柱，父母亲都具有相当的生财能力；养在月柱:中年后，必定发生桃花情事之忧；养在日柱:六亲缘浅，夫妻难谐，多情致憾；养在时柱:家运圆满，事职安定。
一般来说：命有养的命造，养的表象代表能承受家业，但是与兄弟不合，做事情表象温和，不图立杆见影，与母亲有着深厚的情谊，以及受母亲影响比较大。为人多有洁癖，做事比较有拖泥带水现象，往往遇事不能随机应变。男女都有感情问题，甚至总是失和不断。男命不宜创办事业，最好依人作嫁，反而能够得到相当成就和发展。女命则中年丧或失夫，天性悲观，无积极性，但是生活还是不错的，女命工作和婚缘，直到晚运方能够吉顺安详。下面按天干分坐来详细说明：

甲养在戌，在日柱代表婚姻不佳，有六合者，先凶后吉。
乙养在未，有良好的兄弟情谊以及得同窗的相助。
丙养在丑，日主如果无根，会经常有疾病。
丁养在戌，自坐库，为人保守，不宜做投机的生意，以及流动性的商人。
戊养在丑，是活动能力很强的人，即使处于逆境，也会有贵人相助。
己养在戌，在月支有破损，然后得家属的帮助。
庚养在辰，魁罡论，会受母亲的性格影响。
辛养在丑，家族观念影响深刻，多为亲属所包围。
壬养在未，如果没有刑冲，可以继承家业，而做内部实际掌权。
癸养在辰，为人个性十分含蓄，守成有余而发展不足。

长生十二宫:
长生；沐浴；冠带；临官（建禄）；帝旺；衰；病；死；墓（库）；绝；胎；养。代表五行在十二个月份里面所经历生命历程的诠释，它们周而复始，循环往复，十二宫的轮回就像人类生老病死的变化。

长生：
年柱长生父母助，月柱夫妻恩爱共，
日柱一生富贵全，时柱后人更丰隆。

沐浴：
年柱父母婚姻顺，月柱妇妻易离别，
日柱沐浴贪酒色，时柱桃花风流人。

冠带：　　　临官，　　　帝旺，
年柱得旺祖业隆，月柱衣食更丰隆，
但怕女人旺太过，夫妻反目婚多重，
日上得旺福贵全，时上得旺后人丰。

衰：　　　　病，　　　　死，
年上遇此祖业衰，月柱家事也不宁，
日柱自身运不旺，时上子女也但惊。

墓：
年上墓库祖业衰，月柱父母能守财，
只是女命月坐墓，口角连连性情乖，
日上墓库为四贵，时上墓库冷后人。

绝：
年上祖业多飘零，月柱双亲难共鸣，
日绝夫妻有灾殃，时绝子女情伤伤。

胎：
年上逢胎祖业厚，月胎父母抚爱长，
中年职业多变更，婚姻也会起波浪，
日上遇胎为四贵，胎中头产是姑娘。

养：
年柱养地是养子，月柱养地运势强，
日做养地多清闲，时养儿女孝爹娘。

阳：　　　　　　　　　　　　阴：
金长生在巳，木长生在亥，　　　辛金长生在子，卯木长生在午。
丙戊生在寅，水长生在申。　　　癸水长生在卯，丁已长生在酉。

老怕帝旺，少怕衰，中年最怕死绝胎。
金衰木绝，土怕养，水病火死不久长。

金怕临官木怕衰，　土交沐浴有祸灾。
火到死地无处救，　水流绝地不回来。

少年墓库，湖湖涂涂，中年墓库，颠倒反复，老年墓库，发财发福。

#####################
十二长生的含义和意象】

长生：就像人出生于世，或降生阶段，是指万物萌发之际。其包含有出生、生长、来源、起点、帮助、依靠、靠山、哺育、源泉、根子、原始、苏醒、获救、救助、产生、寻找、得到、发生、吃饭等意思。

沐浴：婴儿降生后洗浴以去除污垢，是指万物出生，承受大自然沐浴。含有洗澡、入水、裸体、淫亵、脱衣、恩泽、好处、有利、暴露、光秃秃、光溜、光滑、享受、坦诚、大小便、睡觉、破败、难看、无耻、滋润、照顾等意思。

冠带：为小儿可以穿衣戴帽了，是指万物渐荣。含有穿衣、整装、和衣、打扮、包装、装饰、衣服、升级、荣誉、戴帽、入伍、遮盖、外表、高贵等意思。

临冠：像人长成强壮，可以做官，化育，领导人民，是指万物长成。含有公家的、官府、有病、灾祸、有男人在身边、离死不远、巴结当官的、阿谀奉迎、出仕、当官、拍马屁、有官运、有地位、公务员、自力更生、自我努力、成长、快要成功、国营、危险等意思。

帝旺：象征人壮盛到极点，可辅助帝王大有作为，是指万物成熟。含有荣发、发达、得意、精神、兴奋、神气、有力、雄壮、高大、擅长、强大、辉煌、欣欣向荣、腾达、有权、极限、高潮、顶点等意思。

衰：指盛极而衰，是指万物开始发生衰变。含有无力、软弱、衰弱、弱小、不景气、弱智、败落、力小、倒霉、退缩、没靠山、弱点、胆小、虚弱、矮小、无能、没本事、不学无术、高不成低不就、不敢反抗等意思。

病：如人患病，是指万物困顿。有疾病、病灶、瘟神、讨厌、憎恨、仇人、仇视、不足之处、缺点、欠缺、毛病、弱点、漏洞、把柄、要害、心病、腐败、问题等意思。

死：如人气已尽，形体已死，是指万物死灭。含有死亡、钻牛角尖、不灵活、不能变通、滞留、、终结、完蛋、认死理、一条道走道黑、没有余地、不景气、无生气、无活力、呆板、笨拙、想不开、心胸狭窄、无退路、寂静、安静、可怕等意思。

墓：也称“库”，如人死后归入于墓，是指万物成功后归库。含有包容、收藏、埋藏、关闭、收拾、存放、管理、管制、属于、控制、操纵、指挥、包含、囊括、陷阱、不自由、入迷、受管束、隐藏、保护、护卫、围拦、仓库、权限、昏沉、糊涂、黑暗、不流畅、不畅通、结束、阻力、堵塞等意思。

绝：如人形体绝灭化归为土，是指万物前气已绝，后继之气还未到来，在地中未有其象。含有无退路、危险、绝地、绝境、悬崖、分手、断绝、背水一战、失望、心灰意冷、死心、无可救药、无能为力、无情、冷酷、不通融、停止、消失、无影无踪等意思。

胎：如人受父母之气结聚成胎，是指天地气交之际，后继之气来临，并且受胎。含有怀胎、酝酿、初步打算、计划、形成、先天的、与生俱来的、天生的、本性难移、初级、勾连、牵挂、操心、想法、幼稚、弱小、年龄小、起步等。

养：像人养胎于母腹之中，之后又出生，是指万物在地中成形，继而又萌发，又得经历一个生生灭灭永不停止的天道循环过程。含有出生、生长、寄托、收养、休养、疗养、休息、依靠、营养、滋养、扶助、怀疑、不放心、不踏实、心虚、操心、不安、过继、培养、养育、弱小、扶持等意思。

【12长生诀的运用方法】

一、十二长生的用法与详解

1、长生：十二长生中，长生是处于第一位的，所谓长生其实指的就是宝宝刚出生，或者新事物刚造成时，具备生机勃勃的气场。

2、沐浴：十二长生中，沐浴又称“败”，意思就是指婴儿降生后须洗去污垢，新事物初登台，很不完善。

3、冠带：十二长生中，冠是遮阳帽的意思，带便是古时候配饰的意思。所谓冠带就是古代男女法定年龄二十岁所举办的成年人礼数式，这个时候表明早已成年人了。

4、临官：十二长生中，临官又被称为建禄，是一个人生命过程的第四个阶段，也就是说一个人通过长生、沐浴、冠带之后，然后长成强壮，去创业谋生，就有了出路，这个时候就可以做官了。

5、帝旺：十二长生中，帝旺在临冠之后，临官就是指一个人开始做官，应该算是走上正路，到了帝旺就是要达到顶峰。

6、衰：十二长生中，衰是一个人人生的第六个阶段，表示着一个人的生机开始由旺转弱，也就是所谓的“盛极必衰”。

7、病：十二长生中，病代表的是是生物体发生不健康的现象，也代表有缺点、错误、损害、祸害、不满、责备等等。

8、死：十二长生中，死代表人之死亡，万物之毁灭。比如甲木见午为死，通俗的讲其实就是甲木在午火之地燃烧殆尽的意思。

9、墓：十二长生中，墓代表万物成功而载入库，或人之终而归墓也。如果一个人八字运行墓地，那么这个人往往有钱财积蓄。

10、绝：十二长生中，绝代表的意思就是一种绝然安静的自然转变，也就是在无声无息之中，再显露生机。

11、胎：十二长生中，胎是人生的第十一个阶段，可以说是生命的转机，所谓的胎，也就是说当生命灭绝后，重新结胎，于是新生命便开始了。

12、养：十二长生中，养就好像母亲将小孩生出，这个时候天地与人开始交感相会。如果一个人的八字中有养，那么往往代表能承受家业，但是容易与兄弟不合。

二、十二长生口诀表

沐浴口诀：沐浴水来犯桃花，妇女淫乱不由他，投河自缢随人走，血病目灾破败家，子午方来田业尽，卯酉流来好赌奢，若还冲破生神位，胎堕淫声带锁枷。

养生口诀：第一养生水到堂，贪狼星照显文章，长位儿孙多富贵，人丁昌炽性忠良，水曲特朝官爵重，水小弯环福寿长，养生流破终须绝，少年寡妇守空房。

绝胎口诀：绝胎水到不生儿，无孕无胎绝后枝，纵使有胎难养育，夫妻父子各分离，水大妇人淫乱走，水小私情暗会期，此方只宜为水口，禄存流尽佩金鱼。

冠带口诀：冠带水来人聪慧，也爱风流好赌奢，七岁儿童能作赋，文章博士万人夸，水神流去最为凶，髫龄儿童死不休，更损深闺娇态女，此方停蓄乃为佳。

临官口诀：临官位上水趋坟，禄马朝元喜气新，少年早入青云路，贤相绸缪佐圣君，_最忌此方出水去，成材之子早归阴，家中寡妇常啼哭，财谷空虚彻骨贪。

衰弱口诀：衰方管局巨门星，学堂水到发聪明，少年及第文章贵，长寿星高金谷盈，出入起居乘驷马，宴游歌舞玉壼倾，旺极总宜来去吉，也须弯曲更留情。

帝旺口诀：帝旺水来聚面前，一团旺气发庄田，官高爵重威名显，财库丰盈多税钱，最怕休囚来击散，石崇富贵不多年，旺方流去根基薄，家道贫寒怨上天。

墓库口诀：墓库之方水怕临，破军流去反为祯，阵上扬兵文武贵，池中停蓄富春申，荡然直去家资散，久债终年不了人，水来充军千里外，三男二女总凋零。

病死口诀：病死二方水莫来，天门地户不为开，纵有科名官爵重，水若斜飞起大灾，损妻毒药刀兵祸，血症风瘫女堕胎，必主其家生此祸，瘠痨枯死瘦形骸。